[
    {
        "id": 0,
        "background": "assets/backgrounds/batmale_hall_staircase_1.jpg",
        "speaker": "",
        "text": "Spring arrives at CCSF with a warmth I haven't felt in a long time.",
        "next": [1]
    },
    {
        "id": 1,
        "background": "assets/backgrounds/batmale_hall_staircase_2.jpg",
        "speaker": "",
        "text": "The air carries \\n something weightless, clinging to the skin, like the traces of a forgotten dream. It's the kind of day that reminds the heart it was made for longing, whether real or imagined, love finds its way.",
        "next": [2]
    },
    {
        "id": 2,
        "background": "assets/backgrounds/batmale_hall_elevator.jpg",
        "character": "assets/characters/rocky_normal.png",
        "speaker": "",
        "text": "Batmale Hall stands ahead, its doors as unassuming as ever. I'm visiting the ACRC today, since there are whispers of the free printing available to students, nothing more.",
        "next": [3]
    },
    {
        "id": 3,
        "background": "",
        "speaker": "",
        "text": "I enter the lobby and turn into the staircase. What a weird building.. Third floor disguised as the First floor… This feels like a Batman's secret hideout.",
        "next": [4]
    },
    {
        "id": 4,
        "background": "",
        "speaker": "",
        "text": "I see a sign for the CS Tutor Squad hours posted near its entrance. Before entering, the lights made me a bit more at ease considering the spooky, cold concrete halls I had walked through.",
        "next": [5]
    },
    {
        "id": 5,
        "background": "",
        "speaker": "",
        "text": "Most students are hunched over their own laptops, ignoring the ancient desktops lining the walls.",
        "next": [6]
    },
    {
        "id": 6,
        "background": "",
        "speaker": "",
        "text": "Such focus and determination...... The power level of these brain cells must be over 9000",
        "next": [7]
    },
    {
        "id": 7,
        "background": "",
        "speaker": "",
        "text": "I see the printer-shaped machine as soon as I walk in. Is the AC broken? It feels like a sauna in here. I open up my laptop to find the PDF I am trying to print. ",
        "next": [8]
    },
    {
        "id": 8,
        "background": "",
        "speaker": "",
        "text": "I'm here to print out an essay for my English 1B class. I click one more button before the beast clunks to life. A few more seconds, and… a few hot and fresh pages slide out. It smells like baked bread.",
        "next": [9]
    },
    {
        "id": 9,
        "background": "",
        "speaker": "",
        "text": "The rhythmic shuffle of the printer snaps me back. I slide the pages into a folder, tuck them into my bag, and sling it over my shoulder. I hope i'm not late to class today.",
        "next": [10]
    },
    {
        "id": 10,
        "background": "",
        "speaker": "",
        "text": "...",
        "next": [11]
    },
    {
        "id": 11,
        "background": "",
        "speaker": "",
        "text": "I take in the room. I notice the clutter, or maximalism. At the center, an older gentleman in a red vest sits behind an ellipse shaped table, his quiet authority.",
        "next": [12]
    },
    {
        "id": 12,
        "background": "",
        "speaker": "",
        "text": "The sight of Solo Leveling attracts my eyes. Laying on the counter of his desk was the latest Shonen Jump magazine. AOT, Death Note, a whole pool of anime magazines, stickers and trinkets displayed on his desk as I slowly edged closer for a better look.",
        "next": [13]
    },
    {
        "id": 13,
        "background": "",
        "speaker": "",
        "text": "His desk faces another room. I peer in, only a whiteboard with faded words and scribbles “General Meeting 2/21” but I don't get the chance to inspect it before---",
        "next": [14]
    },
    {
        "id": 14,
        "background": "",
        "speaker": "",
        "text": "RRRRRRRRRRRRRR",
        "next": [15]
    },
    {
        "id": 15,
        "background": "",
        "speaker": "",
        "text": "The sound scrapes against my nerves. And I instinctively turn toward the loud screech thats more powerful than Goku's super saiyan 3. That printer must have trained all its life for this moment.",
        "next": [16]
    },
    {
        "id": 16,
        "background": "",
        "speaker": "",
        "text": "Tall, frozen mid-motion. Horns curled like a helix in space. His expression is one of pure shock, like he's been caught red-handed. A deer- no, a ram-in headlights.",
        "next": [17]
    },
    {
        "id": 17,
        "background": "",
        "speaker": "",
        "text": "Rocky stands at the printer, stiff as a board, as if sheer willpower might erase the sound that just tore through the room. His hands hover uselessly over the machine, shoulders tense.",
        "next": [18]
    },
    {
        "id": 18,
        "background": "",
        "speaker": "",
        "text": "I hesitate. He's clearly embarrassed. His aura -9000. Not even the gacha gods can save him now. Do I step in or would he just feel very exposed to the embarrassment?",
        "next": [19]
    },
    {
        "id": 19,
        "background": "",
        "speaker": "",
        "text": "I step closer, peeking over his shoulder at the printer screen. He still hasn't said a word—maybe he's too stunned to speak.",
        "next": [20]
    },
    {
        "id": 20,
        "background": "",
        "speaker": "",
        "text": "The screen loads slowly, and when the details appear, I gasp.",
        "next": [21]
    },
    {
        "id": 21,
        "background": "",
        "speaker": "",
        "text": "Rocky jolts at the sound, like a second-hand embarrassment jump scare. He glances at me, wide-eyed and nervous.",
        "next": [22]
    },
    {
        "id": 22,
        "background": "",
        "speaker": "",
        "text": "Immediately noticing his diabolical mistake. I sigh… Should I tell him what's wrong?",
        "next": [23]
    },
    {
        "id": 23,
        "background": "",
        "speaker": "",
        "text": "Rubbing the back of my neck. 'Sooo, the problem is... that you're trying to print a thousand pages???'",
        "next": [24]
    },
    {
        "id": 24,
        "background": "",
        "speaker": "",
        "text": "Rocky blinks. Some of his nervousness fades, replaced by something dangerously close to amusement.",
        "next": [25]
    },
    {
        "id": 25,
        "background": "",
        "speaker": "",
        "text": "'...Yeah?'",
        "next": [26]
    },
    {
        "id": 26,
        "background": "",
        "speaker": "",
        "text": "I stare at him. He stares back.",
        "next": [27]
    },
    {
        "id": 27,
        "background": "",
        "speaker": "",
        "text": "It takes me a second to process how utterly unfazed he is. Like he genuinely expected the printer to handle a mountain of color pages without a hitch.",
        "next": [28]
    },
    {
        "id": 28,
        "background": "",
        "speaker": "",
        "text": "The printer, of course, disagrees. It lets out a weak, defeated beep.",
        "next": [29]
    },
    {
        "id": 29,
        "background": "",
        "speaker": "",
        "text": "Rocky looks at it like he's just been personally betrayed.",
        "next": [30]
    },
    {
        "id": 30,
        "background": "",
        "speaker": "",
        "text": "He has a red paper in his hand, kind of crumpled up now. Rocky hands it to me and quickly runs out the room. Bros embarrassed.",
        "next": [31]
    },
    {
        "id": 31,
        "background": "",
        "speaker": "",
        "text": "I glance at the older gentleman in the red vest—his domain, his problem.",
        "next": [32]
    },
    {
        "id": 32,
        "background": "",
        "speaker": "",
        "text": "Settling into a seat nearby, I grab one of the Shonen Jump magazines and start flipping through.",
        "next": [33]
    },
    {
        "id": 33,
        "background": "",
        "speaker": "",
        "text": "A few pages in, my eyes flick up, catching glimpses of the disaster unfolding.",
        "next": [34]
    },
    {
        "id": 34,
        "background": "",
        "speaker": "",
        "text": "The older gentleman leans over, inspecting the printer. Rocky, still standing there, shifts awkwardly from foot to foot.",
        "next": [35]
    },
    {
        "id": 35,
        "background": "",
        "speaker": "",
        "text": "A quiet exchange happens, and then—Rocky physically recoils. Probably just now realizing the gravity of his thousand-page crime.",
        "next": [36]
    },
    {
        "id": 36,
        "background": "",
        "speaker": "",
        "text": "I stifle a grin and turn the page. Bro is in a infinite boss-fight loop.",
        "next": [37]
    },
    {
        "id": 37,
        "background": "",
        "speaker": "",
        "text": "Rocky turns defeated and quickly exits the ACRC as if he felt the older gentlemen's infinite power level rising to deal with the printer.",
        "next": [38]
    },
    {
        "id": 38,
        "background": "",
        "speaker": "",
        "text": "He left a crumpled red flyer on the printer.",
        "next": [39]
    },
    {
        "id": 39,
        "background": "",
        "speaker": "",
        "text": "It's bright and red. A club fair flyer? “Unity Day”… I keep reading… Today!?",
        "next": [40]
    },
    {
        "id": 40,
        "background": "",
        "speaker": "",
        "text": "It piques my interest actually… and free food. It's at Ram Plaza, by the Student Union building. It'll be open for a couple of hours. Perfect timing, since I'll be hungry once I'm let out of class.",
        "next": [41]
    },
    {
        "id": 41,
        "background": "",
        "speaker": "",
        "text": "Have I fallen for a trap? Is this some sort of cursed technique to lure me to this place?",
        "next": [42]
    },
    {
        "id": 42,
        "background": "",
        "speaker": "",
        "text": "Rocky has already left. I wonder if I'll see him again?",
        "next": [43]
    },
    {
        "id": 43,
        "background": "",
        "speaker": "",
        "text": "...NOO im late for class again.",
        "next": [44]
    },
    {
        "id": 44,
        "background": "",
        "speaker": "",
        "text": "It's 11:59 am. Only a minute before class ends. My tummy grumbles. I haven't eaten all day.. I take out the flyer. let's go check it out. If anything I'll stop by McDonalds.",
        "next": [45]
    },
    {
        "id": 45,
        "background": "",
        "speaker": "",
        "text": "I sprint Cloud Circle towards Ram Plaza, the bass from the speakers banging in my chest. Red tents line the plaza perimeter, students weaving through the crowd, voices overlapping with the music.",
        "next": [46]
    },
    {
        "id": 46,
        "background": "",
        "speaker": "",
        "text": "Students crowd the bright, big ASCO tent. It's probably where I should check in. I make my way over, and see Vaughn, ICC Vice President. He has on his usual fashionable jewelry and jorts.",
        "next": [47]
    },
    {
        "id": 47,
        "background": "",
        "speaker": "",
        "text": "We make eye contact and he hands me a card.",
        "next": [48]
    },
    {
        "id": 48,
        "background": "",
        "speaker": "",
        "text": "There's a grid of all the clubs present today on that stamp card. Every club and resource center should have you stamp it after you visit. Five stamps and this Los Kuyas is yours.",
        "next": [49]
    },
    {
        "id": 49,
        "background": "",
        "speaker": "",
        "text": "He holds up a taco bowl and waves it coyly.",
        "next": [50]
    },
    {
        "id": 50,
        "background": "",
        "speaker": "",
        "text": "I scan the list. Two clubs stand out.",
        "next": [51]
    },
    {
        "id": 51,
        "background": "",
        "speaker": "",
        "text": "CS Club, Anime Club.. Hmmmmm",
        "next": [52]
    },
    {
        "id": 52,
        "background": "",
        "speaker": "",
        "text": "",
        "next": [53]
    },
    {
        "id": 53,
        "background": "",
        "speaker": "",
        "text": "",
        "next": [54]
    },
    {
        "id": 54,
        "background": "",
        "speaker": "",
        "text": "",
        "next": [55]
    },
    {
        "id": 55,
        "background": "",
        "speaker": "",
        "text": "",
        "next": [56]
    },
    {
        "id": 56,
        "background": "",
        "speaker": "",
        "text": "",
        "next": [57]
    },
    {
        "id": 57,
        "background": "",
        "speaker": "",
        "text": "",
        "next": [58]
    },
    {
        "id": 58,
        "background": "",
        "speaker": "",
        "text": "",
        "next": [59]
    },
    {
        "id": 59,
        "background": "",
        "speaker": "",
        "text": "",
        "next": [60]
    }
]